{"body":"\nJavaScript loves having many ways to do the same thing. And asynchronous operations being at the heart of the language, it's not surprising to have more than four different ways of dealing with it!\n\nThe first and simplest one is callbacks. But if you're old enough in the profession to have encountered *callback hell*, you know that this solution brings many problems to the table if you're not cautious.\n\n```javascript\ngetLoggedInUser((err, user) => {\n  if (err) {\n    displayError();\n    return;\n  }\n  getMoviesForUser(user, (err, userMovies) => {\n    if (err) {\n      displayError();\n      return;\n    }\n    getMovieDetails(userMovies[0], (err, movieDetails) => {\n      if (err) {\n        displayError();\n        return;\n      }\n      displayMovie(movieDetails);\n    });\n  });\n})\n```\n\nWe can see that dependent asynchronous calls can quickly get to a high level of nesting in your code. You can extract things into functions to avoid that but it rely on the team being cautious. Also, it's the developer duty to think about handling the potential errors, nothing can prevent her/him from using the `user` variable without testing first that there was no error. As anything that needs a special attention, be sure that it will fail one day!\n\nSo we've found two *better* ways of dealing with asynchronous operations in JavaScript: promises and observables. But what are their differences and when should you use each?\n\n## Promises\n\nA promise is kind of a box representing an asynchronous operation. It can have three states: pending (the operation is not done yet), resolved with success (the operation was successful and the *box* contains the result) and resolved with an error (the operation failed and the promise contains an error object).\n\n<div style=\"text-align: center\">    \n    <img src=\"/images/promises.png\" alt=\"Diagram of a promise's state: the \\\"pending\\\" state can transition to the \\\"success\\\" state or the \\\"error\\\" state\" style=\"max-width: 100%;\">    \n</div>\n\nHere is a sample of code creating a promise:\n\n```js\nfunction createUser(user) {\n\treturn new Promise((resolve, reject) => {\n\t\tdoCreateUser(user, (err, result) => {\n\t\t\tif(err) {\n\t\t\t\treject(err);\n\t\t\t} else {\n\t\t\t\tresolve(result);\n\t\t\t}\n\t\t});\n\t});\n}\n```\n\nHere, we're only wrapping a call using callback into a function that returns a promise. Then the user can use our function:\n\n```js\ncreateUser(user)\n  .then(result => display(result))\n  .catch(err => displayError());\n```\n\nAs soon as we're calling the `createUser()` function, the `doCreateUser()` function will be called.\n\n```js\nconst promise = createUser(user);\n```\n\nThat means that in this example of code, even if we don't use the returned promise (by calling `then` or `catch`), the `doCreateUser()` function will be called and perform its action. **Promises are not *lazy*.**\n\nAnother thing you need to know: promises can only be resolved once. Let's see what that means:\n\n```js\nfunction doSomething() {\n  return new Promise((resolve, reject) => {\n    resolve(1);\n    resolve(2);\n    reject(3);\n  });\n}\n\ndoSomething().then(onSuccess, onFailure);\n```\n\nHere, even if we try to resolve the promise a few more times (two times with success, one time with an error), the promise will only be resolved once with the success value `1`. As a consequence, `onSuccess` will be called once and exactly once with the value `1`. And `onFailure` will never be called.\n\nThis is an important guarantee: **your handler can *at most* be called once.** \"At most\" because you have no guarantee that your promise will ever be resolved, maybe it will forever stay in the *pending* state.\n\nA last thing that seems important to notice is that promises are part of the ECMAScript specification since ES2015: it is part of the JavaScript standard library.\n\n## Observables \n\nMore than being boxes, observables are rather a pipe inside of which values are sent over the time. An observable can produce multiple values and not just one like promises. It can have several states: not started, started, on error or completed. When an observable is started, it can emit events at any moment. But as soon as the observable is completed or there is an error, the observable won't emit any event anymore.\n\n<div style=\"text-align: center\">    \n    <img src=\"/images/observables.png\" alt=\"Diagram of an observable states as described above\" style=\"max-width: 100%;\">    \n</div>\n\nObservables are not part of the ECMAScript specification for now. [There is a proposal](https://github.com/tc39/proposal-observable) that hasn't moved much the last years and is stuck at stage 1. So when we're talking about observables in JavaScript, we are mainly talking about the JavaScript implementation of the [Reactive Extensions](http://reactivex.io/), available under the name [RxJS](https://rxjs.dev/). For example, Angular uses RxJS a lot since its version 2.\n\nRxJS is based on observable streams but adds a layer of operators to handle those streams. These many operators are really useful to transform the data but can be confusing at first and are not part of the initial Observable paradigm. I'd need a whole article only to describe them, so let's focus on the observables themselves.\n","staticData":{}}