{"body":"\nA few years ago, I've had the chance to attend [a presentation from Eric Siber](https://eric.siber.fr/conferences/#personalkanbandepuislestranches) (FR) about personal kanban which led me to try it myself with great success. Today, it's my turn to share my experience with this tool.\n\n## What is it?\n\nA personal kanban is a board that allows you to visualize and keep track of things that you need to do. It's not very different from a standard kanban board, except that the focus is not on a project but on yourself. A personal kanban helps you organize your life. \n\nThe simplest one has only three columns: \"To do\", \"Doing\" and \"Done\". You can either use a physical board with post-its or use a virtual one like [Trello](https://trello.com) (my choice).\n\n<div style=\"text-align: center\">    \n    <img src=\"/images/simple-personal-kanban.png\" alt=\"Image of a simple kanban board with only three columns: \\\"To do\\\", \\\"Doing\\\" and \\\"Done\\\". Each column contains a few tasks\" style=\"max-width: 100%;\">    \n</div>\n\nMaterializing your work like that helps you in several ways: visualizing what you need to do, keeping track of their avancement and remembering what you've already done. \n\n### Remember what to do\n\nAlmost any task can be a part of your personal kanban. Items can be short-term tasks (like housework, calling a friend, ...) as well as life-time goals (have kids, go skydiving, ...) They can have various granularities and it's perfectly okay! \n\nGathering everything in one place is great to remember everything. It allows you to realize what needs to be done. You can then prioritize them according to their importance and their potential deadline.\n\nIt's also a great way to think about what should be on your bucket list, your life goals. They can and will change – of course – but having to think about them and keeping them in your personal kanban will make you more conscious about what you can do to achieve them. Because life goals can have many consequences, having a clear vision of everything that matters is perfect to prioritize them and see how they relates to one another.\n\nThis to-do list will change almost every day. Don't hesitate to remove items that are no longer relevant. Deciding that a thing isn't a life goal anymore and giving up on it is not negative at all. Also, don't forget to track the progress of those you've started.\n\n### Keep track of the avancement\n\nIn a kanban board, the \"doing\" column cannot have more than a certain number of elements. The idea is that you cannot be efficient if your attention and work time is divided between too many tasks. So we add a limit for the number of items in progress.\n\nIn a personal kanban the idea is the same: you should avoid to do too many things at once and try to finish tasks first. [Stop starting, Start finishing](http://www.agilebuddha.com/agile/agile-thinking-stop-starting-start-finishing/).\n\nDon't be too strict about it though. The various granularities of the tasks can mean that some tasks will be in progress during a really long period of time. It's okay if you don't always respect the limit and you can even change it according to the events of your life.\n\n### Remember what you've done\n\nThe last column contains everything you've already done. In Trello, you can archive the tasks instead but I prefer keeping them visible to realize how much I've already done. \n\nRegularly, I advise you to have a look at all the items in this column. There is a great sense of satisfaction when you realize that things are really moving forward, especially life goals!\n\n## My personal kanban\n\nI've quickly changed the format of my personal kanban to another structure. I now have five columns: \"today\", \"week\", \"month\", \"life\" and \"done\". \n\n<div style=\"text-align: center\">    \n    <img src=\"/images/my-personal-kanban.png\" alt=\"Image of my personal kanban board with five columns: \\\"Today\\\", \\\"Week\\\", \\\"Month\\\", \\\"Year\\\" and \\\"Done\\\". Each column contains a few tasks\" style=\"max-width: 100%;\">    \n</div>\n\n\"Today\" doesn't mean that it will done today, but rather that it's a thing that I can and will do really soon. That could in fact be today or tomorrow, or the day after that or next week. But tasks in the \"today\" column are the next I want to focus on.\n\nThe \"week\" column focus on things that are coming quickly and that will need to be done after the \"today\" tasks. Then comes the \"month\" column for tasks that I will do with a longer term.\n\nThe \"life\" column, finally, contains things I'll eventually do but are not really important and also – and this part is the most important – my life goals. It contains my bucket list, and it feels really good to drag one of its item and drop it in one of the other columns. That means I'm focusing on what really matters to me.\n\nBy using this structure, I'm losing a bit of information about what is in progress (even if it's more-or-less the \"today\" column, but it has two advantages. Firstly, I can clearly visualize the priorities of my tasks and secondly I can see how busy I will be at short, medium and long term and anticipate.\n\nSeeing that my \"month\" column is full is the sign that I may need to do some tasks now to release the pressure later. Having too many items in the \"week\" column also forces me to reconsider their priority.\n\n## Shaping your personal kanban\n\nThis structure has worked great for me but maybe it won't be suited to you. You will need to try different structures over various period of time to choose.\n\nYou may use it a lot during some parts of your life and barely look at it during other periods. Just try to regularly clean the tasks that are not relevant anymore and keep track of your progresses.\n\nI feel that I've done more since I've started my own personal kanban and that it's easier to not give up on some personal projects.\n\nReflecting on my life goals was also a game changer for me. It reminded me how many things I wanted to do besides work – even if some of them are work-related. It got me thinking about what was important and how I want to spend my time wealth. [It started my reflexion about life, time and money that you can find on my blog](/blog/time-money-life).\n\n<p class=\"thanks\">Many thanks to <a href=\"https://berthelot.io/\">Florent Berthelot</a> for its helpful review!</p>\n","staticData":{}}